alcalpa/ciclocomputador-esp32/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# PSRAM (necesaria mas adelante para el renderer de tiles en V2)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# FreeRTOS: tick a 1000 Hz para timers de UI mas finos
CONFIG_FREERTOS_HZ=1000

# Bluetooth: solo BLE, no necesitamos BR/EDR clasico
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ONLY=n
